Ran Plan for project: `codebuild/gyanni/tpgd_apnortheast2` dir: `terraform-provisioning/terraform/codebuild/gyanni/tpgd_apnortheast2` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.terraform_remote_state.iam: Reading...
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.security_group: Reading...
data.sops_file.secret_values: Reading...
data.terraform_remote_state.security_group: Read complete after 0s
data.terraform_remote_state.vpc: Read complete after 1s
data.terraform_remote_state.iam: Read complete after 1s
data.sops_file.secret_values: Read complete after 1s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.codebuild_github_token.aws_codebuild_source_credential.github_token will be created
+ resource "aws_codebuild_source_credential" "github_token" {
      + arn         = (known after apply)
      + auth_type   = "PERSONAL_ACCESS_TOKEN"
      + id          = (known after apply)
      + region      = "ap-northeast-2"
      + server_type = "GITHUB"
      + token       = (sensitive value)
    }

  # module.deployment_jenkins.aws_codebuild_project.deployment will be created
+ resource "aws_codebuild_project" "deployment" {
      + arn                  = (known after apply)
      + auto_retry_limit     = (known after apply)
      + badge_enabled        = false
      + badge_url            = (known after apply)
      + build_timeout        = 30
      + description          = "To deploy service"
      + encryption_key       = (known after apply)
      + id                   = (known after apply)
      + name                 = "jenkins-tpgdapne2"
      + project_visibility   = "PRIVATE"
      + public_project_alias = (known after apply)
      + queued_timeout       = 480
      + region               = "ap-northeast-2"
      + service_role         = "arn:aws:iam::289574460446:role/service-role/codebuild-deployment"
      + tags                 = {
          + "Name"       = "jenkins"
          + "billing"    = "tpg"
          + "env"        = "tpg"
          + "stack_name" = "tpgd_apnortheast2"
        }
      + tags_all             = {
          + "Name"       = "jenkins"
          + "billing"    = "tpg"
          + "env"        = "tpg"
          + "stack_name" = "tpgd_apnortheast2"
        }

      + artifacts {
          + encryption_disabled    = false
          + override_artifact_name = false
          + type                   = "NO_ARTIFACTS"
        }

      + cache {
          + type = "NO_CACHE"
        }

      + environment {
          + compute_type                = "BUILD_GENERAL1_SMALL"
          + image                       = "aws/codebuild/amazonlinux2-x86_64-standard:5.0"
          + image_pull_credentials_type = "CODEBUILD"
          + privileged_mode             = false
          + type                        = "LINUX_CONTAINER"

          + environment_variable {
              + name  = "SERVICE_NAME"
              + type  = "PLAINTEXT"
              + value = "JENKINS"
            }
          + environment_variable {
              + name  = "VPC_NAME"
              + type  = "PLAINTEXT"
              + value = "vpc-tmcd_apnortheast2"
            }
          + environment_variable {
              + name  = "TARGET_GROUP_NAME"
              + type  = "PLAINTEXT"
              + value = "jenkins-tmcdapne2-ext"
            }
          + environment_variable {
              + name  = "SECURITY_GROUP_NAME"
              + type  = "PLAINTEXT"
              + value = "jenkins-tmcd_apnortheast2"
            }
          + environment_variable {
              + name  = "EFS_NAME"
              + type  = "PLAINTEXT"
              + value = "jenkins-efs-tmcd_apnortheast2"
            }
          + environment_variable {
              + name  = "ORG_NAME"
              + type  = "PLAINTEXT"
              + value = "zerone-devops"
            }
          + environment_variable {
              + name  = "TEAM_NAME"
              + type  = "PLAINTEXT"
              + value = "admin"
            }
        }

      + source {
          + buildspec       = "buildspec.yml"
          + git_clone_depth = 1
          + location        = "https://github.com/DevopsArtFactory/jenkins-deploy-script.git"
          + type            = "GITHUB"
        }

      + vpc_config {
          + security_group_ids = [
              + "sg-068152325ce520a62",
            ]
          + subnets            = [
              + "subnet-05da56e729950f035",
              + "subnet-087e729aaff2981ad",
            ]
          + vpc_id             = "vpc-0e8c9b50216f8e96f"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p codebuild/gyanni/tpgd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](http://atlantis-402650273.ap-northeast-2.elb.amazonaws.com/lock?id=Gyanni%252Fterraform-playground%252Fterraform-provisioning%252Fterraform%252Fcodebuild%252Fgyanni%252Ftpgd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p codebuild/gyanni/tpgd_apnortheast2`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
